test/performance/scenarios/endurance-test.yml
config:
  target: "http://localhost:3000"
  phases:
    # Long running endurance test
    - duration: 3600  # 1 hour
      arrivalRate: 20
      name: "Endurance - 1 hour sustained load"
  
  plugins:
    metrics-by-endpoint: {}
  
  processor: "../processors/auth-processor.js"

scenarios:
  - name: "Endurance - Normal Usage"
    weight: 100
    flow:
      - post:
          url: "/api/users/login"
          json:
            username: "testuser"
            password: "Test123456"
          capture:
            - json: "$.accessToken"
              as: "token"
      
      - think: 5
      
      - get:
          url: "/api/todos"
          headers:
            Authorization: "Bearer {{ token }}"
      
      - think: 10
      
      - post:
          url: "/api/todos"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            title: "Endurance Test Todo"
            description: "Long running test"
      
      - think: 15