test/performance/scenarios/endurance-test.yml
config:
  target: "https://todo-app-xhn2.onrender.com"  # Will be overridden by --target flag
  phases:
    # Single request endurance test
    - duration: 10
      arrivalCount: 1
      name: "Endurance - 1 hour sustained load"
  
  processor: "../processors/auth-processor.js"

scenarios:
  - name: "Endurance - Normal Usage"
    weight: 100
    flow:
      # Register then login
      - function: "generateRandomUser"
      - post:
          url: "/api/users/register"
          json:
            username: "{{ username }}"
            email: "{{ email }}"
            password: "{{ password }}"
            role: "client"
      - post:
          url: "/api/users/login"
          json:
            username: "{{ username }}"
            password: "{{ password }}"
          capture:
            - json: "$.accessToken"
              as: "token"
      
      - think: 5
      
      - get:
          url: "/api/todos"
          headers:
            Authorization: "Bearer {{ token }}"
      
      - think: 10
      
      - post:
          url: "/api/todos"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            title: "Endurance Test Todo"
            description: "Long running test"
      
      - think: 15