test/performance/scenarios/load-test.yml
config:
  target: "https://todo-app-xhn2.onrender.com"  # Will be overridden by --target flag
  phases:
    # Single request test - 1 request per phase
    - duration: 10
      arrivalCount: 1
      name: "Warm up"
    - duration: 10
      arrivalCount: 1
      name: "Ramp up load"
    - duration: 10
      arrivalCount: 1
      name: "Sustained load"
    - duration: 10
      arrivalCount: 1
      name: "Ramp down"
  
  processor: "../processors/auth-processor.js"
  
  variables:
    baseUrl: "https://todo-app-xhn2.onrender.com/api"  # Will use target from config

scenarios:
  - name: "User Registration Flow"
    weight: 10
    flow:
      - function: "generateRandomUser"
      - think: 1  # Add delay before registration
      - post:
          url: "/api/users/register"
          json:
            username: "{{ username }}"
            email: "{{ email }}"
            password: "{{ password }}"
            role: "client"
          capture:
            - json: "$.user.id"
              as: "userId"
      - think: 2  # Delay after registration

  - name: "User Login Flow"
    weight: 30
    flow:
      # First register a user, then login
      - function: "generateRandomUser"
      - post:
          url: "/api/users/register"
          json:
            username: "{{ username }}"
            email: "{{ email }}"
            password: "{{ password }}"
            role: "client"
      - think: 1  # Add delay before login
      - post:
          url: "/api/users/login"
          json:
            username: "{{ username }}"
            password: "{{ password }}"
          capture:
            - json: "$.accessToken"
              as: "token"
      - think: 3  # Increased delay after login

  - name: "Todo CRUD Operations"
    weight: 60
    flow:
      # First register a user, then login
      - function: "generateRandomUser"
      - post:
          url: "/api/users/register"
          json:
            username: "{{ username }}"
            email: "{{ email }}"
            password: "{{ password }}"
            role: "client"
      - think: 1  # Add delay before login
      - post:
          url: "/api/users/login"
          json:
            username: "{{ username }}"
            password: "{{ password }}"
          capture:
            - json: "$.accessToken"
              as: "token"
      
      - think: 2  # Delay after login
      
      # Create todo
      - post:
          url: "/api/todos"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            title: "Performance Test Todo {{ $randomString() }}"
            description: "Created during load test"
          capture:
            - json: "$.todo.id"
              as: "todoId"
      
      - think: 2  # Increased delay
      
      # Get all todos
      - get:
          url: "/api/todos"
          headers:
            Authorization: "Bearer {{ token }}"
      
      - think: 2  # Increased delay
      
      # Update todo
      - patch:
          url: "/api/todos/{{ todoId }}"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            title: "Updated Todo"
            completed: true
      
      - think: 2  # Increased delay
      
      # Delete todo
      - delete:
          url: "/api/todos/{{ todoId }}"
          headers:
            Authorization: "Bearer {{ token }}"