test/performance/scenarios/load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    # Warm-up phase
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    # Ramp up to normal load
    - duration: 120
      arrivalRate: 10
      rampTo: 50
      name: "Ramp up load"
    # Sustained load
    - duration: 300
      arrivalRate: 50
      name: "Sustained load"
    # Ramp down
    - duration: 60
      arrivalRate: 50
      rampTo: 5
      name: "Ramp down"
  
  processor: "../processors/auth-processor.js"
  
  variables:
    baseUrl: "http://localhost:3000/api"

scenarios:
  - name: "User Registration Flow"
    weight: 10
    flow:
      - function: "generateRandomUser"
      - post:
          url: "/api/users/register"
          json:
            username: "{{ username }}"
            email: "{{ email }}"
            password: "{{ password }}"
            role: "client"
          capture:
            - json: "$.user.id"
              as: "userId"

  - name: "User Login Flow"
    weight: 30
    flow:
      - post:
          url: "/api/users/login"
          json:
            username: "testuser"
            password: "Test123456"
          capture:
            - json: "$.accessToken"
              as: "token"
      - think: 2

  - name: "Todo CRUD Operations"
    weight: 60
    flow:
      # Login first
      - post:
          url: "/api/users/login"
          json:
            username: "testuser"
            password: "Test123456"
          capture:
            - json: "$.accessToken"
              as: "token"
      
      # Create todo
      - post:
          url: "/api/todos"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            title: "Performance Test Todo {{ $randomString() }}"
            description: "Created during load test"
          capture:
            - json: "$.todo.id"
              as: "todoId"
      
      - think: 1
      
      # Get all todos
      - get:
          url: "/api/todos"
          headers:
            Authorization: "Bearer {{ token }}"
      
      - think: 1
      
      # Update todo
      - patch:
          url: "/api/todos/{{ todoId }}"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            title: "Updated Todo"
            completed: true
      
      - think: 1
      
      # Delete todo
      - delete:
          url: "/api/todos/{{ todoId }}"
          headers:
            Authorization: "Bearer {{ token }}"