test/performance/scenarios/spike-test.yml
config:
  target: "https://todo-app-xhn2.onrender.com"  # Will be overridden by --target flag
  phases:
    # Single request test - 1 request per phase
    - duration: 10
      arrivalCount: 1
      name: "Normal baseline"
    - duration: 10
      arrivalCount: 1
      name: "Traffic spike"
    - duration: 10
      arrivalCount: 1
      name: "Back to normal"
    - duration: 10
      arrivalCount: 1
      name: "Second larger spike"
    - duration: 10
      arrivalCount: 1
      name: "Recovery period"
  
  processor: "../processors/auth-processor.js"

scenarios:
  - name: "Spike - Authentication"
    weight: 50
    flow:
      # Register then login
      - function: "generateRandomUser"
      - think: 2  # Delay before registration
      - post:
          url: "/api/users/register"
          json:
            username: "{{ username }}"
            email: "{{ email }}"
            password: "{{ password }}"
            role: "client"
      - think: 2  # Delay after registration
      - post:
          url: "/api/users/login"
          json:
            username: "{{ username }}"
            password: "{{ password }}"
      - think: 3  # Delay after login

  - name: "Spike - Todo Reads"
    weight: 50
    flow:
      # Register then login
      - function: "generateRandomUser"
      - think: 2  # Delay before registration
      - post:
          url: "/api/users/register"
          json:
            username: "{{ username }}"
            email: "{{ email }}"
            password: "{{ password }}"
            role: "client"
      - think: 2  # Delay after registration
      - post:
          url: "/api/users/login"
          json:
            username: "{{ username }}"
            password: "{{ password }}"
          capture:
            - json: "$.accessToken"
              as: "token"
      - think: 3  # Delay after login
      - get:
          url: "/api/todos"
          headers:
            Authorization: "Bearer {{ token }}"