test/performance/scenarios/spike-test.yml
config:
  target: "http://localhost:3000"
  phases:
    # Normal load
    - duration: 60
      arrivalRate: 10
      name: "Normal baseline"
    # Sudden spike
    - duration: 30
      arrivalRate: 500
      name: "Traffic spike"
    # Back to normal
    - duration: 60
      arrivalRate: 10
      name: "Back to normal"
    # Another spike
    - duration: 30
      arrivalRate: 1000
      name: "Second larger spike"
    # Recovery
    - duration: 120
      arrivalRate: 10
      name: "Recovery period"
  
  processor: "../processors/auth-processor.js"

scenarios:
  - name: "Spike - Authentication"
    weight: 50
    flow:
      - post:
          url: "/api/users/login"
          json:
            username: "testuser"
            password: "Test123456"

  - name: "Spike - Todo Reads"
    weight: 50
    flow:
      - post:
          url: "/api/users/login"
          json:
            username: "testuser"
            password: "Test123456"
          capture:
            - json: "$.accessToken"
              as: "token"
      - get:
          url: "/api/todos"
          headers:
            Authorization: "Bearer {{ token }}"