test/performance/scenarios/stress-test.yml
config:
  target: "http://localhost:3000"
  phases:
    # Normal load
    - duration: 60
      arrivalRate: 10
      name: "Normal load baseline"
    # Ramp to high load
    - duration: 120
      arrivalRate: 10
      rampTo: 100
      name: "Ramp to stress level"
    # Maximum stress
    - duration: 180
      arrivalRate: 100
      rampTo: 200
      name: "Maximum stress"
    # Extreme stress
    - duration: 120
      arrivalRate: 200
      rampTo: 300
      name: "Extreme stress"
    # Recovery
    - duration: 60
      arrivalRate: 300
      rampTo: 10
      name: "Recovery"
  
  processor: "../processors/auth-processor.js"

scenarios:
  - name: "Heavy Login Load"
    weight: 40
    flow:
      - post:
          url: "/api/users/login"
          json:
            username: "testuser"
            password: "Test123456"
          capture:
            - json: "$.accessToken"
              as: "token"

  - name: "Concurrent Todo Operations"
    weight: 60
    flow:
      - post:
          url: "/api/users/login"
          json:
            username: "testuser"
            password: "Test123456"
          capture:
            - json: "$.accessToken"
              as: "token"
      
      - loop:
          - post:
              url: "/api/todos"
              headers:
                Authorization: "Bearer {{ token }}"
              json:
                title: "Stress Test Todo {{ $randomString() }}"
                description: "Created during stress test"
          - get:
              url: "/api/todos"
              headers:
                Authorization: "Bearer {{ token }}"
        count: 10