test/performance/scenarios/stress-test.yml
config:
  target: "https://todo-app-xhn2.onrender.com"  # Will be overridden by --target flag
  phases:
    # Single request test - 1 request per phase
    - duration: 10
      arrivalCount: 1
      name: "Normal load baseline"
    - duration: 10
      arrivalCount: 1
      name: "Ramp to stress level"
    - duration: 10
      arrivalCount: 1
      name: "Maximum stress"
    - duration: 10
      arrivalCount: 1
      name: "Extreme stress"
    - duration: 10
      arrivalCount: 1
      name: "Recovery"
  
  processor: "../processors/auth-processor.js"

scenarios:
  - name: "Heavy Login Load"
    weight: 40
    flow:
      # Register then login
      - function: "generateRandomUser"
      - think: 1  # Delay before registration
      - post:
          url: "/api/users/register"
          json:
            username: "{{ username }}"
            email: "{{ email }}"
            password: "{{ password }}"
            role: "client"
      - think: 1  # Delay after registration
      - post:
          url: "/api/users/login"
          json:
            username: "{{ username }}"
            password: "{{ password }}"
          capture:
            - json: "$.accessToken"
              as: "token"
      - think: 2  # Delay after login

  - name: "Concurrent Todo Operations"
    weight: 60
    flow:
      # Register then login
      - function: "generateRandomUser"
      - think: 1  # Delay before registration
      - post:
          url: "/api/users/register"
          json:
            username: "{{ username }}"
            email: "{{ email }}"
            password: "{{ password }}"
            role: "client"
      - think: 1  # Delay after registration
      - post:
          url: "/api/users/login"
          json:
            username: "{{ username }}"
            password: "{{ password }}"
          capture:
            - json: "$.accessToken"
              as: "token"
      
      - think: 2  # Delay before loop
      - loop:
          - post:
              url: "/api/todos"
              headers:
                Authorization: "Bearer {{ token }}"
              json:
                title: "Stress Test Todo {{ $randomString() }}"
                description: "Created during stress test"
          - get:
              url: "/api/todos"
              headers:
                Authorization: "Bearer {{ token }}"
        count: 10